# dev-ops tools 
brew "awscli"
brew "terraform"
brew "tflint"
brew "terraform-docs"
cask "devtoys"


# command line tools
brew "antigen"
brew "bat" # syntax highlighting for cat
brew "fzf" # fuzzy finder
brew "eza" # modern replacement for ls
cask "ghostty"
brew "git"
cask "git-credential-manager"
brew "pre-commit"
brew "stow"
brew "zoxide"

# programming languages
brew "go"
brew "golangci-lint"
brew "gofumpt"
brew "node"

# database tools
cask "dbvisualizer"
brew "liquibase"

# python tools
brew "uv"
brew "pytest"
brew "ruff"

# productivity tools
cask "raycast"
# cask "rectangle" # raycast has this functionality
cask "bitwarden"
cask "microsoft-teams"
cask "postman"

# ide and editors
cask "visual-studio-code"
vscode "charliermarsh.ruff"
vscode "christian-kohler.path-intellisense"
vscode "dbaeumer.vscode-eslint"
vscode "esbenp.prettier-vscode"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.vscode-github-actions"
vscode "yoavbls.pretty-ts-errors"
vscode "golang.go"
vscode "hashicorp.terraform"